trade_exp/src/Documents/ОценкаСотрудника/ОценкаСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="31dad2e1-52ed-47e0-8e0c-ea66f9c6cc99">
  <name>ОценкаСотрудника</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3e4e02bd-ccf9-4fe3-9537-b410d239a264">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="028eb805-5562-48f7-b7ba-e77df0517f7c">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a4403a3-3ccf-4461-9c91-4a6e6666ac26">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="512a2aa7-f75a-407b-b117-2843f292c050">
    <name>ШаблонОцениванияСотрудника</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f0a47e44-59f5-4577-a40b-d97c6ae8d312">
    <name>ОценкиКомпетенций</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9ecc3cfe-d803-4a2f-91b8-5360b52e9673">
      <name>Компетенция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="84b74966-e7ea-4876-8356-d25e65842de7">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/ОценкаСотрудника/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Автор.Пустая() Тогда
		ЗаполнитьАвтораНаСервере();
	КонецЕсли;	
	ПолучитьВариантыОценокНаСервере();
	ЗаполнитьГруппыКомпетенций();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвтораНаСервере()
	Объект.Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

&НаСервере
Процедура ПолучитьВариантыОценокНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	КомпетенцииСотрудников.Код КАК Код,
	 |	ЕСТЬNULL(ВариантыОценокКомпетенцииОценки.Наименование, """") КАК Наименование,
	 |	ЕСТЬNULL(ВариантыОценокКомпетенцииОценки.Балл, 0) КАК Балл
	 |ИЗ
	 |	Справочник.КомпетенцииСотрудников КАК КомпетенцииСотрудников
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыОценокКомпетенции КАК ВариантыОценокКомпетенции
	 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыОценокКомпетенции.Оценки КАК ВариантыОценокКомпетенцииОценки
	 |			ПО ВариантыОценокКомпетенции.Ссылка = ВариантыОценокКомпетенцииОценки.Ссылка
	 |		ПО КомпетенцииСотрудников.ВариантОценки = ВариантыОценокКомпетенции.Ссылка
	 |ГДЕ
	 |	НЕ КомпетенцииСотрудников.ЭтоГруппа
	 |	И НЕ ВариантыОценокКомпетенции.ПометкаУдаления";
	
	ВариантыОценок.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	Если НЕ Объект.ШаблонОцениванияСотрудника.Пустая()Тогда
		ЗаполнитьКомпетенции();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблонОцениванияСотрудникаПриИзменении(Элемент)
	Если НЕ Объект.ШаблонОцениванияСотрудника.Пустая()Тогда
		ЗаполнитьКомпетенции();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКомпетенции()	
	Если Объект.ОценкиКомпетенций.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, );
		ПоказатьВопрос(Оповещение, "Данные табличной части будут очищены. Продолжить?", Режим, 0);
	Иначе
		ЗаполнитьКомпетенцииНаСервере();
		ЗаполнитьГруппыКомпетенций();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
        ЗаполнитьКомпетенцииНаСервере();
		ЗаполнитьГруппыКомпетенций();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомпетенцииНаСервере()
	Объект.ОценкиКомпетенций.Загрузить(Объект.ШаблонОцениванияСотрудника.Компетенции.Выгрузить());	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГруппыКомпетенций()
	Если Объект.ОценкиКомпетенций.Количество() = 0 Тогда Возврат КонецЕсли;
	НачНомер = Объект.ОценкиКомпетенций[0].ПолучитьИдентификатор();
	Для НомерСтроки = НачНомер По НачНомер + Объект.ОценкиКомпетенций.Количество() - 1 Цикл
		Элементы.ОценкиКомпетенций.ТекущаяСтрока = НомерСтроки;
		Компетенция = Элементы.ОценкиКомпетенций.ТекущиеДанные.Компетенция;
		Элементы.ОценкиКомпетенций.ТекущиеДанные.ГруппаКомпетенций = ПолучитьГруппуКомпетенции(Компетенция);
	КонецЦикла;
	Элементы.ОценкиКомпетенций.ТекущаяСтрока = НачНомер;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКодКомпетенции(Компетенция)
    Возврат Компетенция.Код;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьГруппуКомпетенции(Компетенция)
    Возврат Компетенция.Родитель;
КонецФункции

&НаКлиенте
Процедура ОценкиКомпетенцийПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Компетенция = Элемент.ТекущиеДанные.Компетенция;	                                
	Если Элемент.ТекущийЭлемент.Имя = "ОценкиКомпетенцийЗначение" Тогда
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Код", ПолучитьКодКомпетенции(Компетенция));
		Строки = ВариантыОценок.НайтиСтроки(ПараметрыОтбора);
		Список = Новый СписокЗначений();
		Для Каждого Строка Из Строки Цикл
			Если Строка.Наименование <> "" Тогда
				Список.Добавить(Строка.Наименование);
			КонецЕсли;
		КонецЦикла;
	    Если Список.Количество() > 0 Тогда
			Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеВыбора", ЭтотОбъект, );
			ПоказатьВыборИзСписка(Оповещение, Список, Элемент.ТекущийЭлемент);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбора(Результат, Параметры) Экспорт
	Если Результат <> Неопределено Тогда
		Элементы.ОценкиКомпетенций.ТекущиеДанные.Значение = Результат.Значение;
	КонецЕсли;
	НомерСтроки = Элементы.ОценкиКомпетенций.ТекущаяСтрока;
	Если НомерСтроки + 1 = Объект.ОценкиКомпетенций.Количество() Тогда
		Элементы.ОценкиКомпетенций.ТекущаяСтрока = НомерСтроки - 1;
	Иначе
		Элементы.ОценкиКомпетенций.ТекущаяСтрока = НомерСтроки + 1;
	КонецЕсли;
КонецПроцедуры
